<h1>Task 01</h1>

In [126]:
import pandas as pd     #Imporing pandas library

In [127]:
#Loading customers dataset
df_customers=pd.read_csv('customers.csv')
df_customers

    CustomerID  Age         City
0            1   22     New York
1            2   23  Los Angeles
2            3   24      Chicago
3            4   25      Houston
4            5   26      Phoenix
..         ...  ...          ...
95          96   27     New York
96          97   28  Los Angeles
97          98   29      Chicago
98          99   30      Houston
99         100   31      Phoenix

[100 rows x 3 columns]

In [128]:
#Loading sales dataset
df_sales=pd.read_csv('sales.csv')
df_sales

     SaleID  CustomerID     Product  Amount
0       101           1      Laptop     200
1       102           2  Smartphone     500
2       103           3      Tablet     800
3       104           4  Headphones    1100
4       105           5     Monitor    1400
..      ...         ...         ...     ...
395     496          96      Laptop     200
396     497          97  Smartphone     500
397     498          98      Tablet     800
398     499          99  Headphones    1100
399     500         100     Monitor    1400

[400 rows x 4 columns]

In [129]:
df_sales.head()     #To display first few rows of 'sales' dataset

   SaleID  CustomerID     Product  Amount
0     101           1      Laptop     200
1     102           2  Smartphone     500
2     103           3      Tablet     800
3     104           4  Headphones    1100
4     105           5     Monitor    1400

In [130]:
df_sales.shape      #To display no. of rows and no. of columns of 'sales' dataset

(400, 4)

In [131]:
df_customers.head()      #To display first few rows of 'customers' dataset

   CustomerID  Age         City
0           1   22     New York
1           2   23  Los Angeles
2           3   24      Chicago
3           4   25      Houston
4           5   26      Phoenix

In [132]:
df_customers.shape      #To display no. of rows and no. of columns of 'customers' dataset

(100, 3)

In [133]:
df_customers.CustomerID.isna().sum()    #To check for missing values in dataset 'customers' in column 'CustomerID'

np.int64(0)

In [134]:
df_customers.Age.isna().sum()      #To check for missing values in dataset 'customers' in column 'Age'

np.int64(0)

In [135]:
df_customers.City.isna().sum()  #To check for missing values in dataset 'customers' in column 'City'

np.int64(0)

In [136]:
df_sales.SaleID.isna().sum()    #To check for missing values in dataset 'sales' in column 'SaleID'

np.int64(0)

In [137]:
df_sales.CustomerID.isna().sum()    #To check for missing values in dataset 'sales' in column 'CustomerID'

np.int64(0)

In [138]:
df_sales.Product.isna().sum()   #To check for missing values in dataset 'sales' in column 'Product'

np.int64(0)

In [139]:
df_sales.Amount.isna().sum()    #To check for missing values in dataset 'sales' in column 'Amount'

np.int64(0)

<h3>It shows that there is no Null value</h3>

<h1>Task 2</h1>

In [140]:
customers_dict=df_customers.to_dict(orient="records")   #Converting customers dataframe into Python dictionary

In [141]:
#Function to filter customers from a specific city using dictionary
def filter_customers_by_city_dict(customers,city):
    return [customer for customer in customers if customer["City"]==city]

#Filter customers from "New York"
filtered_customers_dict=filter_customers_by_city_dict(customers_dict,"New York")
filtered_customers_dict

[{'CustomerID': 1, 'Age': 22, 'City': 'New York'},
 {'CustomerID': 6, 'Age': 27, 'City': 'New York'},
 {'CustomerID': 11, 'Age': 32, 'City': 'New York'},
 {'CustomerID': 16, 'Age': 37, 'City': 'New York'},
 {'CustomerID': 21, 'Age': 42, 'City': 'New York'},
 {'CustomerID': 26, 'Age': 47, 'City': 'New York'},
 {'CustomerID': 31, 'Age': 22, 'City': 'New York'},
 {'CustomerID': 36, 'Age': 27, 'City': 'New York'},
 {'CustomerID': 41, 'Age': 32, 'City': 'New York'},
 {'CustomerID': 46, 'Age': 37, 'City': 'New York'},
 {'CustomerID': 51, 'Age': 42, 'City': 'New York'},
 {'CustomerID': 56, 'Age': 47, 'City': 'New York'},
 {'CustomerID': 61, 'Age': 22, 'City': 'New York'},
 {'CustomerID': 66, 'Age': 27, 'City': 'New York'},
 {'CustomerID': 71, 'Age': 32, 'City': 'New York'},
 {'CustomerID': 76, 'Age': 37, 'City': 'New York'},
 {'CustomerID': 81, 'Age': 42, 'City': 'New York'},
 {'CustomerID': 86, 'Age': 47, 'City': 'New York'},
 {'CustomerID': 91, 'Age': 22, 'City': 'New York'},
 {'CustomerID': 96, 'Age': 27, 'City': 'New York'}]

In [142]:
#To filter customers from a specific city using DataFrame
filtered_customers_df=df_customers[df_customers["City"]=="New York"]
filtered_customers_df

    CustomerID  Age      City
0            1   22  New York
5            6   27  New York
10          11   32  New York
15          16   37  New York
20          21   42  New York
25          26   47  New York
30          31   22  New York
35          36   27  New York
40          41   32  New York
45          46   37  New York
50          51   42  New York
55          56   47  New York
60          61   22  New York
65          66   27  New York
70          71   32  New York
75          76   37  New York
80          81   42  New York
85          86   47  New York
90          91   22  New York
95          96   27  New York

In [143]:
#Comparing efficiency from both approaches
import timeit
# Measuring time in case of dictionary
dict_time=timeit.timeit(
    lambda:filter_customers_by_city_dict(customers_dict,"New York"),
    number=1000,)
# Measure time in case of DataFrame
df_time=timeit.timeit(
    lambda:df_customers[df_customers["City"] == "New York"],
    number=1000,)

print(f"Dictionary filtering time: {dict_time} seconds")
print(f"DataFrame filtering time: {df_time} seconds")

Dictionary filtering time: 0.008517300710082054 seconds
DataFrame filtering time: 0.27120389975607395 seconds

<h1>Task 3</h1>

In [144]:
#Identifying duplicate rows
duplicates=df_customers[df_customers.duplicated()]
duplicates

Empty DataFrame
Columns: [CustomerID, Age, City]
Index: []

<h4>Since there are no duplicates, so there is no need to remove them.</h4>

<h1>Task 4</h1>

In [145]:
# Create a new column with 10% discount applied
df_sales["Discounted_Amount"]=df_sales["Amount"]*0.9
df_sales["Discounted_Amount"]

0       180.0
1       450.0
2       720.0
3       990.0
4      1260.0
        ...
395     180.0
396     450.0
397     720.0
398     990.0
399    1260.0
Name: Discounted_Amount, Length: 400, dtype: float64

In [146]:
# Group by Product and calculate total sales
total_sales_by_product=df_sales.groupby("Product")["Discounted_Amount"].sum().reset_index()
# Renaming the column
total_sales_by_product.rename(columns={"Discounted_Amount": "Total_Sales"}, inplace=True)
total_sales_by_product

      Product  Total_Sales
0  Headphones      79200.0
1      Laptop      14400.0
2     Monitor     100800.0
3  Smartphone      36000.0
4      Tablet      57600.0

In [147]:
#Presenting in well structured format
total_sales_by_product=total_sales_by_product.sort_values(by="Total_Sales",ascending=False)
print("Total Sales by Product (after discount):")
print(total_sales_by_product)

Total Sales by Product (after discount):
      Product  Total_Sales
2     Monitor     100800.0
0  Headphones      79200.0
4      Tablet      57600.0
3  Smartphone      36000.0
1      Laptop      14400.0

<h1>Task 5</h1>

In [148]:
#Filtering the data in the customers.csv file to retain only those customers whose age falls in the range 25 to 35.
filtered_data=df_customers[(df_customers["Age"] >= 25) & (df_customers["Age"] <= 35)]
filtered_data

    CustomerID  Age         City
3            4   25      Houston
4            5   26      Phoenix
5            6   27     New York
6            7   28  Los Angeles
7            8   29      Chicago
8            9   30      Houston
9           10   31      Phoenix
10          11   32     New York
11          12   33  Los Angeles
12          13   34      Chicago
13          14   35      Houston
33          34   25      Houston
34          35   26      Phoenix
35          36   27     New York
36          37   28  Los Angeles
37          38   29      Chicago
38          39   30      Houston
39          40   31      Phoenix
40          41   32     New York
41          42   33  Los Angeles
42          43   34      Chicago
43          44   35      Houston
63          64   25      Houston
64          65   26      Phoenix
65          66   27     New York
66          67   28  Los Angeles
67          68   29      Chicago
68          69   30      Houston
69          70   31      Phoenix
70          71   32     New York
71          72   33  Los Angeles
72          73   34      Chicago
73          74   35      Houston
93          94   25      Houston
94          95   26      Phoenix
95          96   27     New York
96          97   28  Los Angeles
97          98   29      Chicago
98          99   30      Houston
99         100   31      Phoenix

In [149]:
#Counting the customers who belong to each city within the age 25 to 35
filtered_data1=filtered_data.groupby("City").size().reset_index(name="Customers")
filtered_data1

          City  Customers
0      Chicago          7
1      Houston         11
2  Los Angeles          7
3     New York          7
4      Phoenix          8

<h1>Task 6</h1>

In [150]:
merged_dataset=pd.merge(df_customers, df_sales, on="CustomerID", how="outer")
merged_dataset

,CustomerID,Age,City,SaleID,Product,Amount,Discounted_Amount
0,1,22,New York,101,Laptop,200,180.0
1,1,22,New York,201,Laptop,200,180.0
2,1,22,New York,301,Laptop,200,180.0
3,1,22,New York,401,Laptop,200,180.0
4,2,23,Los Angeles,102,Smartphone,500,450.0
...,...,...,...,...,...,...,...
395,99,30,Houston,499,Headphones,1100,990.0
396,100,31,Phoenix,200,Monitor,1400,1260.0
397,100,31,Phoenix,300,Monitor,1400,1260.0
398,100,31,Phoenix,400,Monitor,1400,1260.0
399,100,31,Phoenix,500,Monitor,1400,1260.0

In [151]:
#Group by City and calculate total sales
total_sales_by_city=merged_dataset.groupby("City")["Discounted_Amount"].sum().reset_index()
#Renaming the column
total_sales_by_city.rename(columns={"Discounted_Amount": "Total_Sales"}, inplace=True)
#Sorting the data by total sales in descending order
sales_by_city_sorted=total_sales_by_city.sort_values(by="Total_Sales", ascending=False)
#First row will have the highest sales
highest_sales_city=sales_by_city_sorted.iloc[0]
#Displaying the city with the highest total sales
print("City with the highest total sales: ")
print(highest_sales_city)

City with the highest total sales:
City            Phoenix
Total_Sales    100800.0
Name: 4, dtype: object

In [152]:
#Group by Product and calculate its units sold
total_units_of_product=merged_dataset.groupby("Product")["Product"].value_counts().reset_index()
#Renaming the column
total_units_of_product.rename(columns={"Product": "Product Units"}, inplace=True)
#Sorting the data by Product Units in descending order
products_by_units_sorted=total_units_of_product.sort_values(by="Product Units", ascending=False)
#First row will have the highest sales
most_sold_product=products_by_units_sorted.iloc[0]
#Displaying the city with the highest total sales
print("Product with most units sold: ")
print(most_sold_product)

Product with most units sold:
Product Units    Tablet
count                80
Name: 4, dtype: object

<h1>Task 7</h1>

In [153]:
#Displaying unique values in column 'City'.
unique_city_values=merged_dataset['City'].unique()
unique_city_values

array(['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix'],
      dtype=object)

In [154]:
#Displaying unique values in column 'Product'.
unique_product_values=merged_dataset['Product'].unique()
unique_product_values

array(['Laptop', 'Smartphone', 'Tablet', 'Headphones', 'Monitor'],
      dtype=object)

In [155]:
#Calculating mean of column 'Amount'.
amount_mean=merged_dataset['Amount'].mean()
print("Mean of Amount: ",amount_mean)

Mean of Amount:  800.0

In [156]:
#Calculating median of column 'Amount'.
amount_median=merged_dataset['Amount'].median()
print("Median of Amount: ",amount_median)

Median of Amount:  800.0